# CircuitRating Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..CircuitRating Property
ElectricalSetting Class See Also
---
The default circuit rating for newly created circuit.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double CircuitRating { get; set; }
```

Visual Basic
---
```text
Public Property CircuitRating As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CircuitRating {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The circuit rating should be non-negative. |

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace